--  Создан командой "--fill 5"
 -- Добавление пользователей
INSERT INTO users (first_name, last_name, email, password, avatar) VALUES
('Alexander', 'Petrov', 'alex@fmail.com', '5bCVYakgpc', 'foto.png'),
('Tatyana', 'Veselova', 'tatyana@fmail.com', 'NaeE2ink3Q', 'picture.jpeg');

-- Добавление публикаций
INSERT INTO articles (title, announce, full_text, created_date, picture, user_id) VALUES
('Как достигнуть успеха не вставая с кресла', 'Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много.', 'Как начать действовать? Для начала просто соберитесь. Основываясь на математических моделях в Китае проживает не более 500 миллионов человек. Золотое сечение — соотношение двух величин, гармоническая пропорция. Из под его пера вышло 8 платиновых альбомов. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравится только игры. Таяние Арктических льдов на 70 лет опередило мрачные прогонозы.', '2021-01-07', 'mosaic.jpeg', 2),
('Как перестать беспокоиться и начать жить', 'Это один из лучших рок-музыкантов. Простые ежедневные упражнения помогут достичь успеха. Основываясь на математических моделях в Китае проживает не более 500 миллионов человек.', 'Лисица размножается раз в год, весной. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравится только игры. Золотое сечение — соотношение двух величин, гармоническая пропорция. Он написал больше 30 хитов. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Вы считаете, что заводите кота для себя, чтобы гладить теплое и пушистое существо и снимать стресс. Возможно, главный в доме уже не вы. Когда-то была профессия будильщика - по утрам специальный человек ходил и стучал палкой в окна людей. Из под его пера вышло 8 платиновых альбомов. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Собрать камни бесконечности легко, если вы прирожденный герой. Ёлки — это не просто красивое дерево. Это прочная древесина. Таяние Арктических льдов на 70 лет опередило мрачные прогонозы. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Это один из лучших рок-музыкантов. Программировать не настолько сложно, как об этом говорят.', '2021-01-04', 'cat.png', 1),
('Таяние льдов Арктики. Миф или реальность?', 'Это один из лучших рок-музыкантов.', 'Ёлки — это не просто красивое дерево. Это прочная древесина. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Таяние Арктических льдов на 70 лет опередило мрачные прогонозы. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Достичь успеха помогут ежедневные повторения. Золотое сечение — соотношение двух величин, гармоническая пропорция. Основываясь на математических моделях в Китае проживает не более 500 миллионов человек. Первая большая ёлка была установлена только в 1938 году. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Как начать действовать? Для начала просто соберитесь. Это один из лучших рок-музыкантов. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравится только игры. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Из под его пера вышло 8 платиновых альбомов. Программировать не настолько сложно, как об этом говорят. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Простые ежедневные упражнения помогут достичь успеха. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.', '2021-01-19', 'paint.jpeg', 1),
('Как перестать беспокоиться и начать жить', 'Простые ежедневные упражнения помогут достичь успеха. Собрать камни бесконечности легко, если вы прирожденный герой. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравится только игры. Достичь успеха помогут ежедневные повторения.', 'Собрать камни бесконечности легко, если вы прирожденный герой. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Лисица размножается раз в год, весной. Простые ежедневные упражнения помогут достичь успеха. Как начать действовать? Для начала просто соберитесь. Золотое сечение — соотношение двух величин, гармоническая пропорция. Вы считаете, что заводите кота для себя, чтобы гладить теплое и пушистое существо и снимать стресс. Возможно, главный в доме уже не вы. Основываясь на математических моделях в Китае проживает не более 500 миллионов человек. Первая большая ёлка была установлена только в 1938 году. Это один из лучших рок-музыкантов. Из под его пера вышло 8 платиновых альбомов. Достичь успеха помогут ежедневные повторения. Таяние Арктических льдов на 70 лет опередило мрачные прогонозы. Когда-то была профессия будильщика - по утрам специальный человек ходил и стучал палкой в окна людей. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Ёлки — это не просто красивое дерево. Это прочная древесина.', '2021-01-01', 'mosaic.jpeg', 2),
('Отнимут ли роботы нашу работу?', 'Он написал больше 30 хитов. Таяние Арктических льдов на 70 лет опередило мрачные прогонозы. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много.', 'Собрать камни бесконечности легко, если вы прирожденный герой. Программировать не настолько сложно, как об этом говорят. Это один из лучших рок-музыкантов. Ёлки — это не просто красивое дерево. Это прочная древесина. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Лисица размножается раз в год, весной. Достичь успеха помогут ежедневные повторения. Простые ежедневные упражнения помогут достичь успеха. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравится только игры. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Первая большая ёлка была установлена только в 1938 году.', '2020-10-30', 'dog.jpeg', 2);

-- Добавление комментариев
INSERT INTO comments (text, created_date, article_id, user_id) VALUES
('Планируете записать видосик на эту тему Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.', '2021-01-07', 5, 1),
('Мне кажется или я уже читал это где-то?', '2020-12-26', 4, 1),
('Это где ж такие красоты?', '2020-12-23', 2, 1),
('Совсем немного... Согласен с автором! Это где ж такие красоты?', '2021-01-06', 1, 1),
('Это где ж такие красоты?', '2020-12-27', 3, 1),
('Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.', '2020-10-25', 1, 1),
('Планируете записать видосик на эту тему Совсем немного... Это где ж такие красоты?', '2020-12-09', 5, 2),
('Согласен с автором! Хочу такую же футболку :-)', '2021-01-19', 4, 2),
('Совсем немного... Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.', '2020-11-09', 2, 2),
('Это где ж такие красоты? Хочу такую же футболку :-) Плюсую, но слишком много буквы!', '2021-01-10', 1, 2),
('Совсем немного... Планируете записать видосик на эту тему', '2020-12-07', 3, 2),
('Плюсую, но слишком много буквы! Мне кажется или я уже читал это где-то? Совсем немного...', '2020-12-01', 1, 2);

-- Добавление категорий
INSERT INTO categories (title) VALUES
('Деревья'),
('За жизнь'),
('Без рамки'),
('Разное'),
('IT'),
('Музыка'),
('Кино'),
('Программирование'),
('Железо'),
('Читальный зал'),
('Авто'),
('Насущные проблемы России'),
('DIY'),
('Робототехника');

-- Связь категорий с публикациями
INSERT INTO articles_categories (article_id, category_id) VALUES
(4, 1),
(1, 12),
(2, 4),
(1, 7),
(5, 3),
(3, 6),
(4, 11),
(2, 8),
(5, 12),
(3, 5);
